Configuration/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Catalogs/Номенклатура/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

    Если НЕ ЗначениеЗаполнено(СчетБухгалтерскогоУчета) Тогда
        Возврат;
    КонецЕсли;

    Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
        СчетДопустим = (СчетБухгалтерскогоУчета = ПланыСчетов.Хозрасчетный.Товары);
    ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда
        СчетДопустим = (СчетБухгалтерскогоУчета = ПланыСчетов.Хозрасчетный.Материалы);
    ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
        СчетДопустим = (СчетБухгалтерскогоУчета = ПланыСчетов.Хозрасчетный.РасходыНаПродажу
            ИЛИ СчетБухгалтерскогоУчета = ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
    Иначе
        СчетДопустим = Истина;
    КонецЕсли;

    Если НЕ СчетДопустим Тогда
        ОбщегоНазначения.СообщитьПользователю(
            СтрШаблон("Счет %1 недопустим для типа номенклатуры ""%2"".",
                СчетБухгалтерскогоУчета, ТипНоменклатуры),
            , "Объект.СчетБухгалтерскогоУчета", , Отказ);
    КонецЕсли;

КонецПроцедуры
